Revit 2026 API

# FilterableValueProviderGetStringValue Method

---

Gets a string value from the given element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string GetStringValue(
	Element element
)
```
```vb
Public Function GetStringValue (
	element As Element
) As String
```
```cpp
public:
String^ GetStringValue(
	Element^ element
)
```
```fsharp
member GetStringValue :
        element : Element -> string
```

#### Parameters

element Element
     The element to query.

#### Return Value

String The string value from the element.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

FilterableValueProvider Class

Autodesk.Revit.DB Namespace